dbw_workbook.org
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:
#+LATEX_HEADER:
#+LATEX_HEADER_EXTRA:
#+DESCRIPTION:
#+KEYWORDS:
#+SUBTITLE:
#+LATEX_COMPILER: pdflatex
#+DATE: \today
#+OPTIONS: ^:nil

#+TITLE: Workbook on Drive-by-Wire Node

* Requirement understanding

** Input
 - Input: /current_velocity
 - Input: /twist_cmd
 - input: /vehicle/dbw_enabled

/twist_cmd is the representation of the required the target linear and angular velocity.

** Output
 - Output: /vehicle/throttle_cmd
 - Output: /vehicle/steering_cmd
 - Output: /vehicle/brake_cmd

The requirement is to output the above commands so that the vehicle can drive correctly on the track,
based on its current speed, and the desired speed at the current waypoint, and the state of dbw_enabled.

** Message Types

*** /current_velocity

    #+BEGIN_EXAMPLE
      $ rostopic info /current_velocity
      Type: geometry_msgs/TwistStamped

      Publishers:
       ,* /styx_server (http://yushen:44449/)

      Subscribers:
       ,* /pure_pursuit (http://yushen:45192/)

    #+END_EXAMPLE

*** /twist_cmd
#+BEGIN_EXAMPLE
  $ rostopic info /twist_cmd
  Type: geometry_msgs/TwistStamped

  Publishers:
   ,* /pure_pursuit (http://yushen:45192/)

  Subscribers: None

#+END_EXAMPLE


*** geometry_msgs/TwistStamped

Both /current_velocity and /twist_cmd are of this message type.

Have both the linear and angular velocity in 3D.

#+BEGIN_EXAMPLE
  $ rosmsg info geometry_msgs/TwistStamped
  std_msgs/Header header
    uint32 seq
    time stamp
    string frame_id
  geometry_msgs/Twist twist
    geometry_msgs/Vector3 linear
      float64 x
      float64 y
      float64 z
    geometry_msgs/Vector3 angular
      float64 x
      float64 y
      float64 z

#+END_EXAMPLE

*** /vehicle/dbw_enabled

#+BEGIN_EXAMPLE
  $ rostopic info /vehicle/dbw_enabled
  Type: std_msgs/Bool

  Publishers:
   ,* /styx_server (http://yushen:44449/)

  Subscribers: None

#+END_EXAMPLE

*** Bool

This is the type for /vehicle/dbw_enabled

#+BEGIN_EXAMPLE
  $ rosmsg info std_msgs/Bool
  bool data

#+END_EXAMPLE

*** /vehicle/throttle_cmd

#+BEGIN_EXAMPLE
  $ rostopic info /vehicle/throttle_cmd
  Type: dbw_mkz_msgs/ThrottleCmd

  Publishers:
   ,* /dbw_node (http://yushen:38983/)

  Subscribers:
   ,* /styx_server (http://yushen:44449/)

#+END_EXAMPLE

*** dbw_mkz_msgs/ThrottleCmd

    Where can I find more information on how to program dbw_mkz_msgs/ThrottleCmd?

    In the provided source code of =dbw_node.py= there is a pubilsh method which encapsulates the code required to
    prepare proper messages of ThrottleCmd, SteeringCmd, and BrakeCmd. Therefore, there is no more need to answer the above question.

    It seems that the pedal_cmd_type may have the value of the following:
    - CMD_NONE=0
    - CMD_PEDAL=1
    - CMD_PERCENT=2

    while pedal_cmd may have the actual command value for the mode of CMD_PERCENT, for example, the percent value.
    I'm not sure what would be meaning of the value for pedal_cmd in the mode of CMD_PEDAL, or CMD_NONE. I guess for the mode of CMD_NONE, there is no value needed.

#+BEGIN_EXAMPLE
  $ rosmsg info dbw_mkz_msgs/ThrottleCmd
  uint8 CMD_NONE=0
  uint8 CMD_PEDAL=1
  uint8 CMD_PERCENT=2
  float32 pedal_cmd
  uint8 pedal_cmd_type
  bool enable
  bool clear
  bool ignore
  uint8 count

#+END_EXAMPLE

*** /vehicle/steering_cmd

#+BEGIN_EXAMPLE
  $ rostopic info /vehicle/steering_cmd
  Type: dbw_mkz_msgs/SteeringCmd

  Publishers:
   ,* /dbw_node (http://yushen:38983/)

  Subscribers:
   ,* /styx_server (http://yushen:44449/)

#+END_EXAMPLE

*** dbw_mkz_msgs/SteeringCmd

How to program the values in the following fields?

- steering_wheel_angle_cmd might be the desired steering angle in radius
- steering_wheel_angle_velocity might be the velocity of the steering

how about the other fields?

#+BEGIN_EXAMPLE
  $ rosmsg info dbw_mkz_msgs/SteeringCmd
  float32 steering_wheel_angle_cmd
  float32 steering_wheel_angle_velocity
  bool enable
  bool clear
  bool ignore
  bool quiet
  uint8 count

#+END_EXAMPLE

*** /vehicle/brake_cmd

#+BEGIN_EXAMPLE
  $ rostopic info /vehicle/brake_cmd
  Type: dbw_mkz_msgs/BrakeCmd

  Publishers:
   ,* /dbw_node (http://yushen:38983/)

  Subscribers:
   ,* /styx_server (http://yushen:44449/)

#+END_EXAMPLE

*** dbw_mkz_msgs/BrakeCmd

This is similar to ThrottleCmd, but with some additional/different fields.

#+BEGIN_EXAMPLE
  $ rosmsg info dbw_mkz_msgs/BrakeCmd
  uint8 CMD_NONE=0
  uint8 CMD_PEDAL=1
  uint8 CMD_PERCENT=2
  uint8 CMD_TORQUE=3
  float32 TORQUE_BOO=520
  float32 TORQUE_MAX=3412
  float32 pedal_cmd
  uint8 pedal_cmd_type
  bool boo_cmd
  bool enable
  bool clear
  bool ignore
  uint8 count

#+END_EXAMPLE


