dbw_workbook.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-04 Mon 17:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Workbook on Drive-by-Wire Node</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yu-shen" />
</head>
<body>
<div id="content">
<h1 class="title">Workbook on Drive-by-Wire Node</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org89abfe9">1. Requirement understanding</a>
<ul>
<li><a href="#org1bf15cb">1.1. Input</a></li>
<li><a href="#orgef2baf8">1.2. Output</a></li>
<li><a href="#org301af72">1.3. Message Types</a>
<ul>
<li><a href="#org7825d0d">1.3.1. /current_velocity</a></li>
<li><a href="#org09a154d">1.3.2. /twist_cmd</a></li>
<li><a href="#org36f8d9f">1.3.3. geometry_msgs/TwistStamped</a></li>
<li><a href="#org6a54ae5">1.3.4. /vehicle/dbw_enabled</a></li>
<li><a href="#orgad9acde">1.3.5. Bool</a></li>
<li><a href="#org958fa59">1.3.6. /vehicle/throttle_cmd</a></li>
<li><a href="#org6b19aea">1.3.7. dbw_mkz_msgs/ThrottleCmd</a></li>
<li><a href="#org5f16478">1.3.8. /vehicle/steering_cmd</a></li>
<li><a href="#orgfb3bf8e">1.3.9. dbw_mkz_msgs/SteeringCmd</a></li>
<li><a href="#orgca7757b">1.3.10. /vehicle/brake_cmd</a></li>
<li><a href="#org9db8bb6">1.3.11. dbw_mkz_msgs/BrakeCmd</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd2752e5">2. Architecture discussion</a></li>
<li><a href="#org02ac9fc">3. TwistController</a></li>
<li><a href="#orgfc641bf">4. Source Code Decomposition and Assembly</a>
<ul>
<li><a href="#orgf96f4e8">4.1. Top level assembly</a></li>
<li><a href="#org016b30b">4.2. control_logic</a></li>
<li><a href="#orgcb36776">4.3. twist_controller</a>
<ul>
<li><a href="#org1377b55">4.3.1. Some more leads on twist controller design</a></li>
</ul>
</li>
<li><a href="#org52a7549">4.4. subscribe_to_get_update</a></li>
<li><a href="#orgbf80c35">4.5. dbw_states</a></li>
<li><a href="#org47a5ddc">4.6. callbacks</a></li>
<li><a href="#org0d41a9d">4.7. publish</a></li>
<li><a href="#orgf2ec0c1">4.8. publishers</a></li>
<li><a href="#org3559b6d">4.9. vehicle_parameters</a></li>
<li><a href="#org7617a9b">4.10. preamble</a></li>
</ul>
</li>
<li><a href="#org729fcc8">5. Validations</a></li>
<li><a href="#org329722c">6. Some other interesting message</a>
<ul>
<li><a href="#org656ba28">6.1. /tf Traffic Light (message)?</a></li>
<li><a href="#org82a7f8e">6.2. /tf_static</a></li>
<li><a href="#orgd386a3a">6.3. /traffic_waypoint</a></li>
</ul>
</li>
<li><a href="#org4870609">7. Questions</a></li>
<li><a href="#org9fa8d72">8. <span class="todo TODO">TODO</span> TODO</a></li>
<li><a href="#orgab9249d">9. Verify the /vehicle/*_cmd</a>
<ul>
<li><a href="#org7e8cebd">9.1. Comparison of the control outputs</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org89abfe9" class="outline-2">
<h2 id="org89abfe9"><span class="section-number-2">1</span> Requirement understanding</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1bf15cb" class="outline-3">
<h3 id="org1bf15cb"><span class="section-number-3">1.1</span> Input</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Input: /current_velocity</li>
<li>Input: /twist_cmd</li>
<li>input: /vehicle/dbw_enabled</li>
</ul>

<p>
/twist_cmd is the representation of the required the target linear and angular velocity.
</p>
</div>
</div>

<div id="outline-container-orgef2baf8" class="outline-3">
<h3 id="orgef2baf8"><span class="section-number-3">1.2</span> Output</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Output: /vehicle/throttle_cmd</li>
<li>Output: /vehicle/steering_cmd</li>
<li>Output: /vehicle/brake_cmd</li>
</ul>

<p>
The requirement is to output the above commands so that the vehicle can drive correctly on the track,
based on its current speed, and the desired speed at the current waypoint, and the state of dbw_enabled.
</p>
</div>
</div>

<div id="outline-container-org301af72" class="outline-3">
<h3 id="org301af72"><span class="section-number-3">1.3</span> Message Types</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org7825d0d" class="outline-4">
<h4 id="org7825d0d"><span class="section-number-4">1.3.1</span> /current_velocity</h4>
<div class="outline-text-4" id="text-1-3-1">
<pre class="example">
$ rostopic info /current_velocity
Type: geometry_msgs/TwistStamped

Publishers:
 * /styx_server (http://yushen:44449/)

Subscribers:
 * /pure_pursuit (http://yushen:45192/)

</pre>
</div>
</div>

<div id="outline-container-org09a154d" class="outline-4">
<h4 id="org09a154d"><span class="section-number-4">1.3.2</span> /twist_cmd</h4>
<div class="outline-text-4" id="text-1-3-2">
<pre class="example">
$ rostopic info /twist_cmd
Type: geometry_msgs/TwistStamped

Publishers:
 * /pure_pursuit (http://yushen:45192/)

Subscribers: None

</pre>
</div>
</div>


<div id="outline-container-org36f8d9f" class="outline-4">
<h4 id="org36f8d9f"><span class="section-number-4">1.3.3</span> geometry_msgs/TwistStamped</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Both /current_velocity and /twist_cmd are of this message type.
</p>

<p>
Have both the linear and angular velocity in 3D.
</p>

<pre class="example">
$ rosmsg info geometry_msgs/TwistStamped
std_msgs/Header header
  uint32 seq
  time stamp
  string frame_id
geometry_msgs/Twist twist
  geometry_msgs/Vector3 linear
    float64 x
    float64 y
    float64 z
  geometry_msgs/Vector3 angular
    float64 x
    float64 y
    float64 z

</pre>
</div>
</div>

<div id="outline-container-org6a54ae5" class="outline-4">
<h4 id="org6a54ae5"><span class="section-number-4">1.3.4</span> /vehicle/dbw_enabled</h4>
<div class="outline-text-4" id="text-1-3-4">
<pre class="example">
$ rostopic info /vehicle/dbw_enabled
Type: std_msgs/Bool

Publishers:
 * /styx_server (http://yushen:44449/)

Subscribers: None

</pre>
</div>
</div>

<div id="outline-container-orgad9acde" class="outline-4">
<h4 id="orgad9acde"><span class="section-number-4">1.3.5</span> Bool</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
This is the type for /vehicle/dbw_enabled
</p>

<pre class="example">
$ rosmsg info std_msgs/Bool
bool data

</pre>
</div>
</div>

<div id="outline-container-org958fa59" class="outline-4">
<h4 id="org958fa59"><span class="section-number-4">1.3.6</span> /vehicle/throttle_cmd</h4>
<div class="outline-text-4" id="text-1-3-6">
<pre class="example">
$ rostopic info /vehicle/throttle_cmd
Type: dbw_mkz_msgs/ThrottleCmd

Publishers:
 * /dbw_node (http://yushen:38983/)

Subscribers:
 * /styx_server (http://yushen:44449/)

</pre>
</div>
</div>

<div id="outline-container-org6b19aea" class="outline-4">
<h4 id="org6b19aea"><span class="section-number-4">1.3.7</span> dbw_mkz_msgs/ThrottleCmd</h4>
<div class="outline-text-4" id="text-1-3-7">
<p>
Where can I find more information on how to program dbw_mkz_msgs/ThrottleCmd?
</p>

<p>
In the provided source code of <code>dbw_node.py</code> there is a pubilsh method which encapsulates the code required to
prepare proper messages of ThrottleCmd, SteeringCmd, and BrakeCmd. Therefore, there is no more need to answer the above question.
</p>

<p>
It seems that the pedal_cmd_type may have the value of the following:
</p>
<ul class="org-ul">
<li>CMD_NONE=0</li>
<li>CMD_PEDAL=1</li>
<li>CMD_PERCENT=2</li>
</ul>

<p>
while pedal_cmd may have the actual command value for the mode of CMD_PERCENT, for example, the percent value.
I'm not sure what would be meaning of the value for pedal_cmd in the mode of CMD_PEDAL, or CMD_NONE. I guess for the mode of CMD_NONE, there is no value needed.
</p>

<pre class="example">
$ rosmsg info dbw_mkz_msgs/ThrottleCmd
uint8 CMD_NONE=0
uint8 CMD_PEDAL=1
uint8 CMD_PERCENT=2
float32 pedal_cmd
uint8 pedal_cmd_type
bool enable
bool clear
bool ignore
uint8 count

</pre>
</div>
</div>

<div id="outline-container-org5f16478" class="outline-4">
<h4 id="org5f16478"><span class="section-number-4">1.3.8</span> /vehicle/steering_cmd</h4>
<div class="outline-text-4" id="text-1-3-8">
<pre class="example">
$ rostopic info /vehicle/steering_cmd
Type: dbw_mkz_msgs/SteeringCmd

Publishers:
 * /dbw_node (http://yushen:38983/)

Subscribers:
 * /styx_server (http://yushen:44449/)

</pre>
</div>
</div>

<div id="outline-container-orgfb3bf8e" class="outline-4">
<h4 id="orgfb3bf8e"><span class="section-number-4">1.3.9</span> dbw_mkz_msgs/SteeringCmd</h4>
<div class="outline-text-4" id="text-1-3-9">
<p>
How to program the values in the following fields?
</p>

<ul class="org-ul">
<li>steering_wheel_angle_cmd might be the desired steering angle in radius</li>
<li>steering_wheel_angle_velocity might be the velocity of the steering</li>
</ul>

<p>
how about the other fields?
</p>

<pre class="example">
$ rosmsg info dbw_mkz_msgs/SteeringCmd
float32 steering_wheel_angle_cmd
float32 steering_wheel_angle_velocity
bool enable
bool clear
bool ignore
bool quiet
uint8 count

</pre>
</div>
</div>

<div id="outline-container-orgca7757b" class="outline-4">
<h4 id="orgca7757b"><span class="section-number-4">1.3.10</span> /vehicle/brake_cmd</h4>
<div class="outline-text-4" id="text-1-3-10">
<pre class="example">
$ rostopic info /vehicle/brake_cmd
Type: dbw_mkz_msgs/BrakeCmd

Publishers:
 * /dbw_node (http://yushen:38983/)

Subscribers:
 * /styx_server (http://yushen:44449/)

</pre>
</div>
</div>

<div id="outline-container-org9db8bb6" class="outline-4">
<h4 id="org9db8bb6"><span class="section-number-4">1.3.11</span> dbw_mkz_msgs/BrakeCmd</h4>
<div class="outline-text-4" id="text-1-3-11">
<p>
This is similar to ThrottleCmd, but with some additional/different fields.
</p>

<pre class="example">
$ rosmsg info dbw_mkz_msgs/BrakeCmd
uint8 CMD_NONE=0
uint8 CMD_PEDAL=1
uint8 CMD_PERCENT=2
uint8 CMD_TORQUE=3
float32 TORQUE_BOO=520
float32 TORQUE_MAX=3412
float32 pedal_cmd
uint8 pedal_cmd_type
bool boo_cmd
bool enable
bool clear
bool ignore
uint8 count

</pre>
</div>
</div>
</div>
</div>
