dbw_workbook.org
* Architecture discussion

  Moving the processing of /current_pose message in Waypoint_Updater from a callback to a loop with 2Hz frequency made the car drive
  much longer distance before veering off the road.

  Did the same with the processing of curreent_velocity and desired_velocity in dbw_node, however make the car veer off to the right
  at the same spot, the sharp left turn after the second traffic light. Increasing the frequency from 2 to 10, recover the better driving
  as the time when only changing the processing of /current_pos message.

  This shows that the alignment and synchronization of message processing is crucial.

  The message should be processed as soon as possible but should not block the processing of the messages.

  It would be interesting to test if the frequency 10 can be further reduced.

  loop_frequency for dbw_node tested:
  - 15, seems better than 10, slightly, the best so far
  - 10, good
  - 7,  as good as 10, but not as good as 15
  - 5, better than 3, worse than 10
  -
  - 3, no good
  - 2, no good


* TwistController

  This is the core of the control logic to produce control parameters to control the vehicle based
  on the inputs of the current velocity, the desired velocity, and the state of dbw_enabled state.

  The rest of the code just provides the communication and execution infrastructure.


* Source Code Decomposition and Assembly

  It's my practice of understanding and building source code and explain to myself and other readers.

  I'd decompose the source code into code blocks and them assemble then in terms of such blocks.
  This helps me to focus on each block,
  while getting the whole picture of what the overall program is doing.

** Top level assembly

   This assembly shows the architecture of the source code.

   Experiment to try not using loop, but just control from twist_cmd_cb. It seems still working.
   As long as the control logic does not take too long, it should work.

   Also, experiment showed even using loop, the frequency can be reduced to 2Hz from 50Hz.
   This will significantly reduce the CPU load.
#+NAME:dbw_node
#+BEGIN_SRC python :noweb tangle :tangle ./ros/src/twist_controller/dbw_node.py
  <<preamble>>
  class DBWNode(object):
      def __init__(self):
          rospy.init_node('dbw_node')

          <<vehicle_parametres>>

          self.desired_velocity, self.current_velocity = None, None

          <<publishers>>

          # DONE: Create `TwistController` object

          self.controller = TwistController(vehicle_mass=self.vehicle_mass,
                                            fuel_capacity=self.fuel_capacity,
                                            brake_deadband=self.brake_deadband,
                                            decel_limit=self.decel_limit,
                                            accel_limit=self.accel_limit,
                                            wheel_radius=self.wheel_radius,
                                            wheel_base=self.wheel_base,
                                            steer_ratio=self.steer_ratio,
                                            max_lat_accel=self.max_lat_accel,
                                            max_steer_angle=self.max_steer_angle)
                                            # min_speed=self.min_speed,
                                            # ,
                                            # max_braking_percentage=self.max_braking_percentage,
                                            # max_throttle_percentage=self.max_throttle_percentage,
                                            # max_vel_mps=self.max_vel_mps

          # DONE: Subscribe to all the topics you need to
          <<dbw_states>>

          <<subscribe_to_get_update>>

          self.loop()

      def loop(self):
          rate = rospy.Rate(self.loop_freq) # from 50Hz to 2Hz
          dt = 1. / self.loop_freq
          while not rospy.is_shutdown():
              if self.desired_velocity and self.current_velocity:
                  <<control_logic>>
                  self.desired_velocity, self.current_velocity = None, None
              # end of if self.desired_velocity and self.current_velocity
              rate.sleep()

      <<callbacks>>

      def publish(self, throttle, brake, steer):
          <<publish>>

  if __name__ == '__main__':
      DBWNode()
#+END_SRC

** control_logic

In the context of loop and executed once a rate period, to determine the commands and pubilsh commands to vehicle.

#+NAME:control_logic
#+BEGIN_SRC python :noweb tangle :tangle
  # DONE: Get predicted throttle, brake, and steering using `twist_controller`
  # You should only publish the control commands if dbw is enabled
  if self.dbw_enabled:
      throttle, brake, steering = self.controller.control(self.desired_velocity,
                                                          self.current_velocity,
                                                          dt)
      self.publish(throttle, brake, steering)
  # end of self.dbw_enabled
 #+END_SRC

