dbw_workbook.html


<div id="outline-container-orgd2752e5" class="outline-2">
<h2 id="orgd2752e5"><span class="section-number-2">2</span> Architecture discussion</h2>
<div class="outline-text-2" id="text-2">
<p>
Moving the processing of /current_pose message in Waypoint_Updater from a callback to a loop with 2Hz frequency made the car drive
much longer distance before veering off the road.
</p>

<p>
Did the same with the processing of curreent_velocity and desired_velocity in dbw_node, however make the car veer off to the right
at the same spot, the sharp left turn after the second traffic light. Increasing the frequency from 2 to 10, recover the better driving
as the time when only changing the processing of /current_pos message.
</p>

<p>
This shows that the alignment and synchronization of message processing is crucial.
</p>

<p>
The message should be processed as soon as possible but should not block the processing of the messages.
</p>

<p>
It would be interesting to test if the frequency 10 can be further reduced.
</p>

<p>
loop_frequency for dbw_node tested:
</p>
<ul class="org-ul">
<li>15, seems better than 10, slightly, the best so far</li>
<li>10, good</li>
<li>7,  as good as 10, but not as good as 15</li>
<li>5, better than 3, worse than 10</li>
<li></li>

<li>3, no good</li>
<li>2, no good</li>
</ul>
</div>
</div>


<div id="outline-container-org02ac9fc" class="outline-2">
<h2 id="org02ac9fc"><span class="section-number-2">3</span> TwistController</h2>
<div class="outline-text-2" id="text-3">
<p>
This is the core of the control logic to produce control parameters to control the vehicle based
on the inputs of the current velocity, the desired velocity, and the state of dbw_enabled state.
</p>

<p>
The rest of the code just provides the communication and execution infrastructure.
</p>
</div>
</div>


<div id="outline-container-orgfc641bf" class="outline-2">
<h2 id="orgfc641bf"><span class="section-number-2">4</span> Source Code Decomposition and Assembly</h2>
<div class="outline-text-2" id="text-4">
<p>
It's my practice of understanding and building source code and explain to myself and other readers.
</p>

<p>
I'd decompose the source code into code blocks and them assemble then in terms of such blocks.
This helps me to focus on each block,
while getting the whole picture of what the overall program is doing.
</p>
</div>

<div id="outline-container-orgf96f4e8" class="outline-3">
<h3 id="orgf96f4e8"><span class="section-number-3">4.1</span> Top level assembly</h3>
<div class="outline-text-3" id="text-4-1">
<p>
This assembly shows the architecture of the source code.
</p>

<p>
Experiment to try not using loop, but just control from twist_cmd_cb. It seems still working.
As long as the control logic does not take too long, it should work.
</p>

<p>
Also, experiment showed even using loop, the frequency can be reduced to 2Hz from 50Hz.
This will significantly reduce the CPU load.
</p>
<p>
<code>dbw_node</code>:
</p>
<div class="org-src-container">
<pre class="src src-python">&lt;&lt;preamble&gt;&gt;
<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">DBWNode</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">object</span><span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        rospy.init_node<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'dbw_node'</span><span style="color: #4f97d7;">)</span>

        &lt;&lt;vehicle_parametres&gt;&gt;

        <span style="color: #4f97d7; font-weight: bold;">self</span>.desired_velocity, <span style="color: #4f97d7; font-weight: bold;">self</span>.current_velocity = <span style="color: #a45bad;">None</span>, <span style="color: #a45bad;">None</span>

        &lt;&lt;publishers&gt;&gt;

        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #afd8af;">DONE</span><span style="color: #2aa1ae; background-color: #292e34;">: Create `TwistController` object</span>

        <span style="color: #4f97d7; font-weight: bold;">self</span>.controller = TwistController<span style="color: #4f97d7;">(</span>wheel_base=<span style="color: #4f97d7; font-weight: bold;">self</span>.wheel_base,
                                          vehicle_mass=<span style="color: #4f97d7; font-weight: bold;">self</span>.vehicle_mass,
                                          steer_ratio=<span style="color: #4f97d7; font-weight: bold;">self</span>.steer_ratio,
                                          min_speed=<span style="color: #4f97d7; font-weight: bold;">self</span>.min_speed,
                                          max_lat_accel=<span style="color: #4f97d7; font-weight: bold;">self</span>.max_lat_accel,
                                          max_steer_angle=<span style="color: #4f97d7; font-weight: bold;">self</span>.max_steer_angle,
                                          max_braking_percentage=<span style="color: #4f97d7; font-weight: bold;">self</span>.max_braking_percentage,
                                          max_throttle_percentage=<span style="color: #4f97d7; font-weight: bold;">self</span>.max_throttle_percentage,
                                          max_vel_mps=<span style="color: #4f97d7; font-weight: bold;">self</span>.max_vel_mps<span style="color: #4f97d7;">)</span>

        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #afd8af;">DONE</span><span style="color: #2aa1ae; background-color: #292e34;">: Subscribe to all the topics you need to</span>
        &lt;&lt;dbw_states&gt;&gt;
        &lt;&lt;subscribe_to_get_update&gt;&gt;

        <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">self.loop()</span>
        rospy.spin<span style="color: #4f97d7;">()</span>

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">loop</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #7590db;">rate</span> = rospy.Rate<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>.loop_freq<span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">from 50Hz to 2Hz</span>
        <span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #4f97d7; font-weight: bold;">not</span> rospy.is_shutdown<span style="color: #4f97d7;">()</span>:
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.desired_velocity <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.current_velocity:
                &lt;&lt;control_logic&gt;&gt;
                <span style="color: #4f97d7; font-weight: bold;">self</span>.desired_velocity, <span style="color: #4f97d7; font-weight: bold;">self</span>.current_velocity = <span style="color: #a45bad;">None</span>, <span style="color: #a45bad;">None</span>
            <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">end of if self.desired_velocity and self.current_velocity</span>
            rate.sleep<span style="color: #4f97d7;">()</span>

    &lt;&lt;callbacks&gt;&gt;

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">publish</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, throttle, brake, steer<span style="color: #4f97d7;">)</span>:
        &lt;&lt;publish&gt;&gt;

<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">__name__</span> == <span style="color: #2d9574;">'__main__'</span>:
    DBWNode<span style="color: #4f97d7;">()</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org016b30b" class="outline-3">
<h3 id="org016b30b"><span class="section-number-3">4.2</span> control_logic</h3>
<div class="outline-text-3" id="text-4-2">
<p>
In the context of loop and executed once a rate period, to determine the commands and pubilsh commands to vehicle.
</p>

<p>
<code>control_logic</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #cc9393;">TODO</span><span style="color: #2aa1ae; background-color: #292e34;">: Get predicted throttle, brake, and steering using `twist_controller`</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">You should only publish the control commands if dbw is enabled</span>
