dbw_workbook.html
<span style="color: #7590db;">desired_linear_velocity</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>.desired_velocity.linear.x
<span style="color: #7590db;">desired_angular_velocity</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>.desired_velocity.angular.z
<span style="color: #7590db;">current_linear_velocity</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>.current_velocity.linear.x
<span style="color: #7590db;">current_angular_velocity</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>.current_velocity.angular.z

<span style="color: #7590db;">throttle</span>, <span style="color: #7590db;">brake</span>, <span style="color: #7590db;">steering</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>.controller.control<span style="color: #4f97d7;">(</span>
  desired_linear_velocity, desired_angular_velocity,
  current_linear_velocity, current_angular_velocity<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.dbw_enabled:
  <span style="color: #4f97d7; font-weight: bold;">self</span>.publish<span style="color: #4f97d7;">(</span>throttle, brake, steering<span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">end of self.dbw_enabled</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcb36776" class="outline-3">
<h3 id="orgcb36776"><span class="section-number-3">4.3</span> twist_controller</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Based on the current velocity, and the desired velocity in both linear and angular, compute their delta, then use PID to control.
</p>

<p>
There is a PID implementation, but the parameters of P, I, D needs to be determined. I'm guessing the parameters for now.
</p>

<p>
For the steering, it seems that the implementation of YawController can be used as is.
</p>

<p>
The lowpass filter is an average mechanism. I'm not where to use it. With the input of the inputs of
the current and the desired velocity, or the output of the throttle, steering, and brake?
I'm using to smooth the current linear velocity for now.
</p>

<dl class="org-dl">
<dt>11/6</dt><dd></dd>
</dl>
<p>
Also need to implement the mechanism only process the latest message, to avoid stalled command. Callback should be simple.
The message processing should be regulated, only process the most recent one.
</p>

<p>
<code>twist_controller</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> pid <span style="color: #4f97d7; font-weight: bold;">import</span> PID
<span style="color: #4f97d7; font-weight: bold;">from</span> yaw_controller <span style="color: #4f97d7; font-weight: bold;">import</span> YawController
<span style="color: #4f97d7; font-weight: bold;">from</span> lowpass <span style="color: #4f97d7; font-weight: bold;">import</span> LowPassFilter
<span style="color: #4f97d7; font-weight: bold;">import</span> time
<span style="color: #4f97d7; font-weight: bold;">import</span> rospy

<span style="color: #7590db;">GAS_DENSITY</span> = <span style="color: #a45bad;">2</span>.<span style="color: #a45bad;">858</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">ONE_MPH = 0.44704               # 1 miles/hour in meters/second</span>

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">TwistController</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">object</span><span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, wheel_base, vehicle_mass, steer_ratio, min_speed, max_lat_accel, max_steer_angle,
                 max_braking_percentage, max_throttle_percentage, max_vel_mps<span style="color: #4f97d7;">)</span>:
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #cc9393;">TODO</span><span style="color: #2aa1ae; background-color: #292e34;">: Implement</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.sample_time = <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">03</span>  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">based on observation the interval is always around 0.03 seconds</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">self.throttle_controller = PID(2.0, 0.01, 0.02, mn=0.0, mx=1.0)</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.yaw_controller = YawController<span style="color: #4f97d7;">(</span>
            wheel_base, steer_ratio, min_speed, max_lat_accel, max_steer_angle<span style="color: #4f97d7;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.lowpass_filter = LowPassFilter<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">15</span>, <span style="color: #4f97d7; font-weight: bold;">self</span>.sample_time<span style="color: #4f97d7;">)</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">change the past component coefficient from 0.5 to 0.15 to be more responsive</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.brake_coefficient = <span style="color: #a45bad;">10</span>.<span style="color: #a45bad;">0</span>  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">tentative guess</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.vehicle_mass = vehicle_mass
        <span style="color: #4f97d7; font-weight: bold;">self</span>.prev_time = <span style="color: #a45bad;">None</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.steer_ratio = steer_ratio
        <span style="color: #4f97d7; font-weight: bold;">self</span>.max_braking_percentage = max_braking_percentage
        <span style="color: #4f97d7; font-weight: bold;">self</span>.max_throttle_percentage = max_throttle_percentage
        <span style="color: #4f97d7; font-weight: bold;">self</span>.max_vel_mps = max_vel_mps

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">control</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, desired_linear_velocity, desired_angular_velocity,
                current_linear_velocity, current_angular_velocity<span style="color: #4f97d7;">)</span>:
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #cc9393;">TODO</span><span style="color: #2aa1ae; background-color: #292e34;">: Change the arg, kwarg list to suit your needs</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Return throttle, brake, steer</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">if self.prev_time is None:</span>
        <span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">self.prev_time = time.time()</span>
        <span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">return 0., 0., 0.</span>

        <span style="color: #7590db;">desired_linear_velocity_modulated</span> = <span style="color: #4f97d7;">min</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>.max_vel_mps, desired_linear_velocity<span style="color: #4f97d7;">)</span>
        <span style="color: #7590db;">throttle</span>, <span style="color: #7590db;">brake</span> = <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">0</span>, <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">0</span>
        <span style="color: #7590db;">error_linear_velocity</span> = <span style="color: #4f97d7;">(</span>desired_linear_velocity_modulated - current_linear_velocity<span style="color: #4f97d7;">)</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">according to the forum:</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> desired_linear_velocity &gt; current_linear_velocity:
            <span style="color: #4f97d7; font-weight: bold;">if</span> error_linear_velocity / desired_linear_velocity &gt; <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">3</span>:
                <span style="color: #7590db;">throttle</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>.max_throttle_percentage
            <span style="color: #4f97d7; font-weight: bold;">else</span>:
                <span style="color: #7590db;">throttle</span> = <span style="color: #4f97d7;">max</span><span style="color: #4f97d7;">(</span>
                    <span style="color: #bc6ec5;">(</span>error_linear_velocity / desired_linear_velocity<span style="color: #bc6ec5;">)</span>/<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">3</span>*<span style="color: #4f97d7; font-weight: bold;">self</span>.max_throttle_percentage,
                    <span style="color: #4f97d7; font-weight: bold;">self</span>.max_throttle_percentage<span style="color: #4f97d7;">)</span>
            <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">end of if error_linear_velocity / desired_linear_velocity &gt; 0.3</span>
        <span style="color: #4f97d7; font-weight: bold;">elif</span> current_linear_velocity &gt; <span style="color: #a45bad;">1</span>:
            <span style="color: #7590db;">brake</span> = <span style="color: #a45bad;">3250</span>*<span style="color: #4f97d7; font-weight: bold;">self</span>.max_braking_percentage*-<span style="color: #a45bad;">1</span>
        <span style="color: #4f97d7; font-weight: bold;">else</span>:
            <span style="color: #7590db;">brake</span> = <span style="color: #a45bad;">3250</span>*<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">01</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">end of if desired_linear_velocity &gt; current_linear_velocity</span>

        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">rospy.loginfo('throttle: %f; brake: %f' % (throttle, brake))</span>

        <span style="color: #7590db;">error_angular_velocity</span> = desired_angular_velocity - current_angular_velocity

        <span style="color: #7590db;">desired_steer</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>.yaw_controller.get_steering<span style="color: #4f97d7;">(</span>
            desired_linear_velocity_modulated, desired_angular_velocity,
            current_linear_velocity<span style="color: #4f97d7;">)</span>

        <span style="color: #7590db;">current_steer</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>.yaw_controller.get_steering<span style="color: #4f97d7;">(</span>
            desired_linear_velocity_modulated, current_angular_velocity,
            current_linear_velocity<span style="color: #4f97d7;">)</span>

        <span style="color: #7590db;">steer</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>.lowpass_filter.filt<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>desired_steer - current_steer<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">*self.steer_ratio</span>

        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">rospy.loginfo('desired_steer: %f; current_steer: %f; steer: %f' % (desired_steer, current_steer, steer))</span>

        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">self.prev_time = time.time()</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> throttle, brake, steer

    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">def brake(self, error_in_linear_velocity, current_linear_velocity, vehicle_mass):</span>
    <span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;"># might be more fine tuned, might consider vehicle's mass, and the current velocity, etc.</span>
    <span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;"># might use another PID.</span>
    <span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">brake_v = -self.brake_coefficient * error_in_linear_velocity  # assume the brake_v should be positive</span>
    <span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">return max(brake_v, 1.0)</span>
</pre>
</div>
</div>
