dbw_workbook.org
*** Some more leads on twist controller design

    Need to digest further the below info.

 Based on communication from the Slack channel #system-integration:
 #+BEGIN_EXAMPLE
   C S [2 months ago]
   @ddigges @wsteiner This worked for me: pass the yaw from twist_cmd through a low-pass filter and then into the provided YawController, except that when creating the YawController you need to multiply the provided steer_ratio by 8 or so.  And if you are want to go fast, you need to increase max_lat_accel accordingly.  In general, this gives a nice, non-nausea-inducing result.  The problem is that at high speeds, twist_cmd steers the way a racing car would, drifting into the inside lane in order to reduce lateral forces.  But it is, um, mostly ok at 40 mph.
 #+END_EXAMPLE

 Here is some discussion on the controller:

 #+BEGIN_EXAMPLE
   1, the unit transformation is automatically done by Udacity project default.
   2, the difference between current velocity and designed velocity should be input to PID and will output throttle as percent.  This is project default solution.  I give up pid control since it is not easy to tune for carla.
   3,  the brake default unit is Nm. you need calcuate it with: Brake torque = (vehicle_mass + fuel_capacity * GAS_DENSITY) * deceleration * wheel_radius

   https://github.com/xfqbuaa/Cargo-CarND-Capstone
 #+END_EXAMPLE
 It seems that for steering, no PID needed, but need to "multiply the provided steer_ratio by 8 or so".

 Here is another piece on the solution (https://discussions.udacity.com/t/solved-compute-cte-without-car-position/364383/6) :
 #+BEGIN_EXAMPLE
   That isn’t quite right. The CTE is the difference between the car’s actual position, and the position where the car should have been at that time. In other words, it is the distance between the car and the desired path. So to calculate the CTE, you need the car’s current position, and then you need to do a geometrical calculation to find the distance to the linear path interpolated along the waypoints.

   However, I have had success using a completely different approach. The twist_cmd topic is generated by a fancy piece of software called pure_pursuit, which is in the waypoint_follower directory. pure_pursuit uses the current car position, and the waypoints, to calculate the yaw angle that the car needs to follow in order to get onto, and to stay on, the desired path (the waypoint path). This yaw angle is published in the twist_cmd topic. Then another piece of software, twist_controller/yaw_controller.py, converts the yaw angle to a steering setting that you can send to the vehicle. No need for you to compute the CTE yourself, nor to write a PID controller.

   So you can do this in dbw_node.py: extract the yaw angle from twist_cmd, put it through a low-pass filter (because it may be a bit jittery), put that through yaw_controller, and publish the result (the steering value) in the “loop” section of dbw_node.py. But one thing to be aware of, that I learned through trial and error. When you set up YawController, you need to pass it several parameters that have been provided by Udacity. But the Udacity steer_ratio is too low; you need to multiply it by a factor of 8. But then it works pretty well.

   Note that this is just for steering control; you need to follow a different process (probably with a PID controller) to control the velocity. For testing, however, you can just publish a constant throttle value; 0.5 makes the car go about 40 mph, at least on my machine.

   Also: before you do anything else, search the Slack channel for everything by Alexey Makurin. His set of simple parameter changes: https://github.com/amakurin/CarND-Capstone/commit/9809bc60d51c06174f8c8bfe6c40c88ec1c39d5043 will improve the performance of your code immensely.

 #+END_EXAMPLE

** subscribe_to_get_update

In the context of __init__, subscribe to message to get needed updates.

#+NAME:subscribe_to_get_update
#+BEGIN_SRC python :noweb tangle :tangle
  rospy.Subscriber('/current_velocity', TwistStamped, self.current_velocity_cb, queue_size=1)
  rospy.Subscriber('/twist_cmd', TwistStamped, self.twist_cmd_cb, queue_size=1)
  rospy.Subscriber('/vehicle/dbw_enabled', Bool, self.dbw_enabled_cb, queue_size=1)
#+END_SRC


** dbw_states

   In the context of __init__, declared the initial values of the states required for dbw control.

#+NAME:dbw_states
#+BEGIN_SRC python :noweb tangle :tangle
  self.dbw_enabled = False
  self.current_velocity = None
  self.desired_velocity = None
#+END_SRC

** callbacks

In the context of __init__, defines the callback functions for the subscription processing.

Place the control logic in twist_cmd_cb to save CPU load.

#+NAME:callbacks
#+BEGIN_SRC python :noweb tangle :tangle
  def current_velocity_cb(self, msg):
    if self.current_velocity is None:
        self.current_velocity = msg # .twist
    # end of if self.current_velocity is None:
    # self.current_velocity = msg.twist

  def twist_cmd_cb(self, msg):
    self.desired_velocity = msg # .twist

  def dbw_enabled_cb(self, msg):
      self.dbw_enabled = msg.data
#+END_SRC

