dbw_workbook.html

<div id="outline-container-org1377b55" class="outline-4">
<h4 id="org1377b55"><span class="section-number-4">4.3.1</span> Some more leads on twist controller design</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
Need to digest further the below info.
</p>

<p>
Based on communication from the Slack channel #system-integration:
</p>
<pre class="example">
C S [2 months ago]
@ddigges @wsteiner This worked for me: pass the yaw from twist_cmd through a low-pass filter and then into the provided YawController, except that when creating the YawController you need to multiply the provided steer_ratio by 8 or so.  And if you are want to go fast, you need to increase max_lat_accel accordingly.  In general, this gives a nice, non-nausea-inducing result.  The problem is that at high speeds, twist_cmd steers the way a racing car would, drifting into the inside lane in order to reduce lateral forces.  But it is, um, mostly ok at 40 mph.
</pre>

<p>
Here is some discussion on the controller:
</p>

<pre class="example">
1, the unit transformation is automatically done by Udacity project default.
2, the difference between current velocity and designed velocity should be input to PID and will output throttle as percent.  This is project default solution.  I give up pid control since it is not easy to tune for carla.
3,  the brake default unit is Nm. you need calcuate it with: Brake torque = (vehicle_mass + fuel_capacity * GAS_DENSITY) * deceleration * wheel_radius

https://github.com/xfqbuaa/Cargo-CarND-Capstone
</pre>
<p>
It seems that for steering, no PID needed, but need to "multiply the provided steer_ratio by 8 or so".
</p>

<p>
Here is another piece on the solution (<a href="https://discussions.udacity.com/t/solved-compute-cte-without-car-position/364383/6">https://discussions.udacity.com/t/solved-compute-cte-without-car-position/364383/6</a>) :
</p>
<pre class="example">
That isn’t quite right. The CTE is the difference between the car’s actual position, and the position where the car should have been at that time. In other words, it is the distance between the car and the desired path. So to calculate the CTE, you need the car’s current position, and then you need to do a geometrical calculation to find the distance to the linear path interpolated along the waypoints.

However, I have had success using a completely different approach. The twist_cmd topic is generated by a fancy piece of software called pure_pursuit, which is in the waypoint_follower directory. pure_pursuit uses the current car position, and the waypoints, to calculate the yaw angle that the car needs to follow in order to get onto, and to stay on, the desired path (the waypoint path). This yaw angle is published in the twist_cmd topic. Then another piece of software, twist_controller/yaw_controller.py, converts the yaw angle to a steering setting that you can send to the vehicle. No need for you to compute the CTE yourself, nor to write a PID controller.

So you can do this in dbw_node.py: extract the yaw angle from twist_cmd, put it through a low-pass filter (because it may be a bit jittery), put that through yaw_controller, and publish the result (the steering value) in the “loop” section of dbw_node.py. But one thing to be aware of, that I learned through trial and error. When you set up YawController, you need to pass it several parameters that have been provided by Udacity. But the Udacity steer_ratio is too low; you need to multiply it by a factor of 8. But then it works pretty well.

Note that this is just for steering control; you need to follow a different process (probably with a PID controller) to control the velocity. For testing, however, you can just publish a constant throttle value; 0.5 makes the car go about 40 mph, at least on my machine.

Also: before you do anything else, search the Slack channel for everything by Alexey Makurin. His set of simple parameter changes: https://github.com/amakurin/CarND-Capstone/commit/9809bc60d51c06174f8c8bfe6c40c88ec1c39d5043 will improve the performance of your code immensely.

</pre>
</div>
</div>
</div>

<div id="outline-container-org52a7549" class="outline-3">
<h3 id="org52a7549"><span class="section-number-3">4.4</span> subscribe_to_get_update</h3>
<div class="outline-text-3" id="text-4-4">
<p>
In the context of <span class="underline"><span class="underline">init</span></span>, subscribe to message to get needed updates.
</p>

<p>
<code>subscribe_to_get_update</code>:
</p>
<div class="org-src-container">
<pre class="src src-python">rospy.Subscriber<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'/current_velocity'</span>, TwistStamped, <span style="color: #4f97d7; font-weight: bold;">self</span>.current_velocity_cb, queue_size=<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
rospy.Subscriber<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'/twist_cmd'</span>, TwistStamped, <span style="color: #4f97d7; font-weight: bold;">self</span>.twist_cmd_cb, queue_size=<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
rospy.Subscriber<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'/vehicle/dbw_enabled'</span>, Bool, <span style="color: #4f97d7; font-weight: bold;">self</span>.dbw_enabled_cb, queue_size=<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgbf80c35" class="outline-3">
<h3 id="orgbf80c35"><span class="section-number-3">4.5</span> dbw_states</h3>
<div class="outline-text-3" id="text-4-5">
<p>
In the context of <span class="underline"><span class="underline">init</span></span>, declared the initial values of the states required for dbw control.
</p>

<p>
<code>dbw_states</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">self</span>.dbw_enabled = <span style="color: #a45bad;">False</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.current_velocity = <span style="color: #a45bad;">None</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.desired_velocity = <span style="color: #a45bad;">None</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org47a5ddc" class="outline-3">
<h3 id="org47a5ddc"><span class="section-number-3">4.6</span> callbacks</h3>
<div class="outline-text-3" id="text-4-6">
<p>
In the context of <span class="underline"><span class="underline">init</span></span>, defines the callback functions for the subscription processing.
</p>

<p>
Place the control logic in twist_cmd_cb to save CPU load.
</p>

<p>
<code>callbacks</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">current_velocity_cb</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, msg<span style="color: #4f97d7;">)</span>:
  <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.current_velocity <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #a45bad;">None</span>:
      <span style="color: #4f97d7; font-weight: bold;">self</span>.current_velocity = msg.twist
  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">end of if self.current_velocity is None:</span>
  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">self.current_velocity = msg.twist</span>

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">twist_cmd_cb</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, msg<span style="color: #4f97d7;">)</span>:
  <span style="color: #4f97d7; font-weight: bold;">self</span>.desired_velocity = msg.twist
  <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.current_velocity:
    &lt;&lt;control_logic&gt;&gt;
    <span style="color: #4f97d7; font-weight: bold;">self</span>.current_velocity = <span style="color: #a45bad;">None</span>
  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">if self.current_velocity</span>

  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">if self.desired_velocity is None:</span>
  <span style="color: #2aa1ae; background-color: #292e34;">#       </span><span style="color: #2aa1ae; background-color: #292e34;">self.desired_velocity = msg.twist</span>
  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;"># end of if self.desired_velocity is None</span>

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">dbw_enabled_cb</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, msg<span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">self</span>.dbw_enabled = msg.data
</pre>
</div>
</div>
</div>
