dbw_workbook.org
** publish

   In the context of publish function, perform the message fabrications and the acts of publishing.

#+NAME:publish
#+BEGIN_SRC python :noweb tangle :tangle
  tcmd = ThrottleCmd()
  tcmd.enable = True
  tcmd.pedal_cmd_type = ThrottleCmd.CMD_PERCENT
  tcmd.pedal_cmd = throttle
  self.throttle_pub.publish(tcmd)

  scmd = SteeringCmd()
  scmd.enable = True
  scmd.steering_wheel_angle_cmd = steer
  self.steer_pub.publish(scmd)

  bcmd = BrakeCmd()
  bcmd.enable = True
  bcmd.pedal_cmd_type = BrakeCmd.CMD_TORQUE
  bcmd.pedal_cmd = brake
  self.brake_pub.publish(bcmd)
#+END_SRC

** publishers

In the context of __init__, creates the needed publishers.

#+NAME:publishers
#+BEGIN_SRC python :noweb tangle :tangle
  self.steer_pub = rospy.Publisher('/vehicle/steering_cmd',
                                   SteeringCmd, queue_size=1)
  self.throttle_pub = rospy.Publisher('/vehicle/throttle_cmd',
                                      ThrottleCmd, queue_size=1)
  self.brake_pub = rospy.Publisher('/vehicle/brake_cmd',
                                   BrakeCmd, queue_size=1)
#+END_SRC

** vehicle_parameters

In the context of __init__, retrieve parameters of vehicle with default provision.
The parameters might be needed for vehicle commands.

#+NAME:vehicle_parametres
#+BEGIN_SRC python :noweb tangle :tangle
  self.vehicle_mass = rospy.get_param('~vehicle_mass', 1736.35)
  self.fuel_capacity = rospy.get_param('~fuel_capacity', 13.5)
  self.brake_deadband = rospy.get_param('~brake_deadband', .1)
  self.decel_limit = rospy.get_param('~decel_limit', -5)
  self.accel_limit = rospy.get_param('~accel_limit', 1.)
  self.wheel_radius = rospy.get_param('~wheel_radius', 0.2413)
  self.wheel_base = rospy.get_param('~wheel_base', 2.8498)
  self.steer_ratio = rospy.get_param('~steer_ratio', 14.8)
  self.max_lat_accel = rospy.get_param('~max_lat_accel', 3.)
  self.max_steer_angle = rospy.get_param('~max_steer_angle', 8.)
  self.min_speed = rospy.get_param('~min_speed', 4.*0.44704)
  self.max_throttle_percentage = rospy.get_param('~max_throttle_percentage', 0.1)
  self.max_braking_percentage = rospy.get_param('~max_braking_percentage', -0.1)
  self.max_vel_mps = rospy.get_param('waypoint_loader/velocity')*MPH_to_MPS
  self.loop_freq = rospy.get_param('~loop_freq', 2)
  # the frequency to process vehicle messages
#+END_SRC

** preamble

   header, imports, and comments.
#+NAME:preamble
#+BEGIN_SRC python :noweb tangle :tangle
  #!/usr/bin/env python

  import rospy
  from std_msgs.msg import Bool
  from dbw_mkz_msgs.msg import ThrottleCmd, SteeringCmd, BrakeCmd, SteeringReport
  from geometry_msgs.msg import TwistStamped
  import math

  from twist_controller import TwistController

  '''
  You can build this node only after you have built (or partially built) the `waypoint_updater` node.

  You will subscribe to `/twist_cmd` message which provides the proposed linear and angular velocities.
  You can subscribe to any other message that you find important or refer to the document for list
  of messages subscribed to by the reference implementation of this node.

  One thing to keep in mind while building this node and the `twist_controller` class is the status
  of `dbw_enabled`. While in the simulator, its enabled all the time, in the real car, that will
  not be the case. This may cause your PID controller to accumulate error because the car could
  temporarily be driven by a human instead of your controller.

  We have provided two launch files with this node. Vehicle specific values (like vehicle_mass,
  wheel_base) etc should not be altered in these files.

  We have also provided some reference implementations for PID controller and other utility classes.
  You are free to use them or build your own.

  Once you have the proposed throttle, brake, and steer values, publish it on the various publishers
  that we have created in the `__init__` function.

  '''

  MPH_to_MPS = 1609.344/3600.0 # 1 mile = 1609.344 1 hour = 3600 seconds

 #+END_SRC


