dbw_workbook.html

<div id="outline-container-org0d41a9d" class="outline-3">
<h3 id="org0d41a9d"><span class="section-number-3">4.7</span> publish</h3>
<div class="outline-text-3" id="text-4-7">
<p>
In the context of publish function, perform the message fabrications and the acts of publishing.
</p>

<p>
<code>publish</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">tcmd</span> = ThrottleCmd<span style="color: #4f97d7;">()</span>
<span style="color: #7590db;">tcmd.enable</span> = <span style="color: #a45bad;">True</span>
<span style="color: #7590db;">tcmd.pedal_cmd_type</span> = ThrottleCmd.CMD_PERCENT
<span style="color: #7590db;">tcmd.pedal_cmd</span> = throttle
<span style="color: #4f97d7; font-weight: bold;">self</span>.throttle_pub.publish<span style="color: #4f97d7;">(</span>tcmd<span style="color: #4f97d7;">)</span>

<span style="color: #7590db;">scmd</span> = SteeringCmd<span style="color: #4f97d7;">()</span>
<span style="color: #7590db;">scmd.enable</span> = <span style="color: #a45bad;">True</span>
<span style="color: #7590db;">scmd.steering_wheel_angle_cmd</span> = steer
<span style="color: #4f97d7; font-weight: bold;">self</span>.steer_pub.publish<span style="color: #4f97d7;">(</span>scmd<span style="color: #4f97d7;">)</span>

<span style="color: #7590db;">bcmd</span> = BrakeCmd<span style="color: #4f97d7;">()</span>
<span style="color: #7590db;">bcmd.enable</span> = <span style="color: #a45bad;">True</span>
<span style="color: #7590db;">bcmd.pedal_cmd_type</span> = BrakeCmd.CMD_TORQUE
<span style="color: #7590db;">bcmd.pedal_cmd</span> = brake
<span style="color: #4f97d7; font-weight: bold;">self</span>.brake_pub.publish<span style="color: #4f97d7;">(</span>bcmd<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf2ec0c1" class="outline-3">
<h3 id="orgf2ec0c1"><span class="section-number-3">4.8</span> publishers</h3>
<div class="outline-text-3" id="text-4-8">
<p>
In the context of <span class="underline"><span class="underline">init</span></span>, creates the needed publishers.
</p>

<p>
<code>publishers</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">self</span>.steer_pub = rospy.Publisher<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'/vehicle/steering_cmd'</span>,
                                 SteeringCmd, queue_size=<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.throttle_pub = rospy.Publisher<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'/vehicle/throttle_cmd'</span>,
                                    ThrottleCmd, queue_size=<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.brake_pub = rospy.Publisher<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'/vehicle/brake_cmd'</span>,
                                 BrakeCmd, queue_size=<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>


</pre>
</div>
</div>
</div>

<div id="outline-container-org3559b6d" class="outline-3">
<h3 id="org3559b6d"><span class="section-number-3">4.9</span> vehicle_parameters</h3>
<div class="outline-text-3" id="text-4-9">
<p>
In the context of <span class="underline"><span class="underline">init</span></span>, retrieve parameters of vehicle with default provision.
The parameters might be needed for vehicle commands.
</p>

<p>
<code>vehicle_parametres</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">self</span>.vehicle_mass = rospy.get_param<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'~vehicle_mass'</span>, <span style="color: #a45bad;">1736</span>.<span style="color: #a45bad;">35</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.fuel_capacity = rospy.get_param<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'~fuel_capacity'</span>, <span style="color: #a45bad;">13</span>.<span style="color: #a45bad;">5</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.brake_deadband = rospy.get_param<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'~brake_deadband'</span>, .<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.decel_limit = rospy.get_param<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'~decel_limit'</span>, -<span style="color: #a45bad;">5</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.accel_limit = rospy.get_param<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'~accel_limit'</span>, <span style="color: #a45bad;">1</span>.<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.wheel_radius = rospy.get_param<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'~wheel_radius'</span>, <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">2413</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.wheel_base = rospy.get_param<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'~wheel_base'</span>, <span style="color: #a45bad;">2</span>.<span style="color: #a45bad;">8498</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.steer_ratio = rospy.get_param<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'~steer_ratio'</span>, <span style="color: #a45bad;">14</span>.<span style="color: #a45bad;">8</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.max_lat_accel = rospy.get_param<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'~max_lat_accel'</span>, <span style="color: #a45bad;">3</span>.<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.max_steer_angle = rospy.get_param<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'~max_steer_angle'</span>, <span style="color: #a45bad;">8</span>.<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.min_speed = rospy.get_param<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'~min_speed'</span>, <span style="color: #a45bad;">4</span>.*<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">44704</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.max_throttle_percentage = rospy.get_param<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'~max_throttle_percentage'</span>, <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.max_braking_percentage = rospy.get_param<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'~max_braking_percentage'</span>, -<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">self</span>.max_vel_mps = rospy.get_param<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'waypoint_loader/velocity'</span><span style="color: #4f97d7;">)</span>*MPH_to_MPS
<span style="color: #4f97d7; font-weight: bold;">self</span>.loop_freq = rospy.get_param<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'~loop_freq'</span>, <span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">the frequency to process vehicle messages</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7617a9b" class="outline-3">
<h3 id="org7617a9b"><span class="section-number-3">4.10</span> preamble</h3>
<div class="outline-text-3" id="text-4-10">
<p>
header, imports, and comments.
</p>
<p>
<code>preamble</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!/usr/bin/env python</span>

<span style="color: #4f97d7; font-weight: bold;">import</span> rospy
<span style="color: #4f97d7; font-weight: bold;">from</span> std_msgs.msg <span style="color: #4f97d7; font-weight: bold;">import</span> Bool
<span style="color: #4f97d7; font-weight: bold;">from</span> dbw_mkz_msgs.msg <span style="color: #4f97d7; font-weight: bold;">import</span> ThrottleCmd, SteeringCmd, BrakeCmd, SteeringReport
<span style="color: #4f97d7; font-weight: bold;">from</span> geometry_msgs.msg <span style="color: #4f97d7; font-weight: bold;">import</span> TwistStamped
<span style="color: #4f97d7; font-weight: bold;">import</span> math

<span style="color: #4f97d7; font-weight: bold;">from</span> twist_controller <span style="color: #4f97d7; font-weight: bold;">import</span> TwistController

<span style="color: #2d9574;">'''</span>
<span style="color: #2d9574;">You can build this node only after you have built (or partially built) the `waypoint_updater` node.</span>

<span style="color: #2d9574;">You will subscribe to `/twist_cmd` message which provides the proposed linear and angular velocities.</span>
<span style="color: #2d9574;">You can subscribe to any other message that you find important or refer to the document for list</span>
<span style="color: #2d9574;">of messages subscribed to by the reference implementation of this node.</span>

<span style="color: #2d9574;">One thing to keep in mind while building this node and the `twist_controller` class is the status</span>
<span style="color: #2d9574;">of `dbw_enabled`. While in the simulator, its enabled all the time, in the real car, that will</span>
<span style="color: #2d9574;">not be the case. This may cause your PID controller to accumulate error because the car could</span>
<span style="color: #2d9574;">temporarily be driven by a human instead of your controller.</span>

<span style="color: #2d9574;">We have provided two launch files with this node. Vehicle specific values (like vehicle_mass,</span>
<span style="color: #2d9574;">wheel_base) etc should not be altered in these files.</span>

<span style="color: #2d9574;">We have also provided some reference implementations for PID controller and other utility classes.</span>
<span style="color: #2d9574;">You are free to use them or build your own.</span>

<span style="color: #2d9574;">Once you have the proposed throttle, brake, and steer values, publish it on the various publishers</span>
<span style="color: #2d9574;">that we have created in the `__init__` function.</span>

<span style="color: #2d9574;">'''</span>

<span style="color: #7590db;">MPH_to_MPS</span> = <span style="color: #a45bad;">1609</span>.<span style="color: #a45bad;">344</span>/<span style="color: #a45bad;">3600</span>.<span style="color: #a45bad;">0</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">1 mile = 1609.344 1 hour = 3600 seconds</span>

</pre>
</div>
</div>
</div>
</div>
