dbw_workbook.html


<div id="outline-container-org729fcc8" class="outline-2">
<h2 id="org729fcc8"><span class="section-number-2">5</span> Validations</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Start roscore</li>

<li>echo the publishing of
<ul class="org-ul">
<li>/vehicle/throttle_cmd</li>

<li>/vehicle/steering_cmd</li>

<li>/vehicle/brake_cmd</li>
</ul></li>
</ul>

<p>
expect to see the above messages
</p>

<ul class="org-ul">
<li>start the simulator
<ul class="org-ul">
<li>making sure the manual operation is off</li>
<li>select and go</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org329722c" class="outline-2">
<h2 id="org329722c"><span class="section-number-2">6</span> Some other interesting message</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org656ba28" class="outline-3">
<h3 id="org656ba28"><span class="section-number-3">6.1</span> /tf Traffic Light (message)?</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Based on the abbrevation and the subscriber, it might be related to traffic light.
</p>

<p>
Still don't quite understand the meaning of the fields.
</p>
<pre class="example">
rostopic info /tf
Type: tf2_msgs/TFMessage

Publishers: None

Subscribers:
* /tl_detector (http://yushen:43555/)

</pre>

<pre class="example">
rosmsg info tf2_msgs/TFMessage
geometry_msgs/TransformStamped[] transforms
  std_msgs/Header header
    uint32 seq
    time stamp
    string frame_id
  string child_frame_id
  geometry_msgs/Transform transform
    geometry_msgs/Vector3 translation
      float64 x
      float64 y
      float64 z
    geometry_msgs/Quaternion rotation
      float64 x
      float64 y
      float64 z
      float64 w

</pre>
</div>
</div>

<div id="outline-container-org82a7f8e" class="outline-3">
<h3 id="org82a7f8e"><span class="section-number-3">6.2</span> /tf_static</h3>
</div>

<div id="outline-container-orgd386a3a" class="outline-3">
<h3 id="orgd386a3a"><span class="section-number-3">6.3</span> /traffic_waypoint</h3>
</div>
</div>


<div id="outline-container-org4870609" class="outline-2">
<h2 id="org4870609"><span class="section-number-2">7</span> Questions</h2>
</div>

<div id="outline-container-org9fa8d72" class="outline-2">
<h2 id="org9fa8d72"><span class="section-number-2">8</span> <span class="todo TODO">TODO</span> TODO</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Study how to design TwistController</li>
<li>Browse, annotate and absorb the related code</li>
</ul>
</div>
</div>

<div id="outline-container-orgab9249d" class="outline-2">
<h2 id="orgab9249d"><span class="section-number-2">9</span> Verify the /vehicle/*_cmd</h2>
<div class="outline-text-2" id="text-9">
<p>
According to <a href="https://discussions.udacity.com/t/cant-find-the-rosbag-which-dbw-test-used-for-testing/390138/6">https://discussions.udacity.com/t/cant-find-the-rosbag-which-dbw-test-used-for-testing/390138/6</a>
Here is the procedure to perform the verification, kind of unit testing:
</p>

<blockquote>
<p>
I think <a href="https://discussions.udacity.com/t/cant-find-the-rosbag-which-dbw-test-used-for-testing/390138/3">https://discussions.udacity.com/t/cant-find-the-rosbag-which-dbw-test-used-for-testing/390138/3</a> is a rough guide, but the full steps are something like:
</p>

<ol class="org-ol">
<li>download <a href="https://drive.google.com/open?id=0B2_h37bMVw3iT0ZEdlF4N01QbHc4">https://drive.google.com/open?id=0B2_h37bMVw3iT0ZEdlF4N01QbHc4</a></li>
<li>rename the file to dbw_test.rosbag.bag</li>
<li>move the dbw_test.rosbag.bag file to the project root’s data folder, e.g. CarND-Capstone/data/dbw_test.rosbag.bag</li>
<li>Run dbw_test: roslaunch twist_controller dbw_test.launch</li>
</ol>
<p>
Compare your results to the dbw_test output logged in ros/src/twist_controller in three files: brakes.csv, steers.csv, throttles.csv
</p>

<p>
My numbers produced in 5 don’t match the expected output. I think this partially because the bag file (probably) comes from a run on the Carla car, rather than the simulator, and (presumably) the team that wrote the code that generated this bag file tuned their acceleration model to suit the real car rather than the simulator.
</p>

<p>
But I’m confused by the bag file’s brake values, I’ve opened <a href="https://github.com/udacity/sdc-issue-reports/issues/12041">https://github.com/udacity/sdc-issue-reports/issues/12041</a> to either understand the brake values better, or fix them if they’re wrong
</p>
</blockquote>

<p>
To make it work in our environment, I had to modify the launch file or dbw_test.launch adding the include to waypoint_loader's launch file.
</p>

<p>
Next, need to do the comparison in the data collected in brakes.csv, steers.csv, and throttles.csv.
</p>
</div>

<div id="outline-container-org7e8cebd" class="outline-3">
<h3 id="org7e8cebd"><span class="section-number-3">9.1</span> Comparison of the control outputs</h3>
<div class="outline-text-3" id="text-9-1">
<p>
I'd like to try to use Google sheet to see if would provide some excel sheet like plotting functions.
</p>

<ul class="org-ul">
<li>brakes</li>

<li>steers</li>

<li>throttles</li>
</ul>


<p>
<a href="https://docs.google.com/spreadsheets/d/10CxvhIyyFZcAHWsAepPvpqeD0AzGneDMp0ZdCSyoKds/edit?usp=sharing">https://docs.google.com/spreadsheets/d/10CxvhIyyFZcAHWsAepPvpqeD0AzGneDMp0ZdCSyoKds/edit?usp=sharing</a>
</p>

<p>
<a href="https://docs.google.com/spreadsheets/d/1VuvZIt8m_C0OByGyG2jAAazIPiI_bW8joV3aA7_6R8Q/edit?usp=sharing">https://docs.google.com/spreadsheets/d/1VuvZIt8m_C0OByGyG2jAAazIPiI_bW8joV3aA7_6R8Q/edit?usp=sharing</a>
</p>

<p>
<a href="https://docs.google.com/spreadsheets/d/1lnr-AFjVcitUdtJtA6JUfCXLfSmjlO_Em0C0jhCmDnw/edit?usp=sharing">https://docs.google.com/spreadsheets/d/1lnr-AFjVcitUdtJtA6JUfCXLfSmjlO_Em0C0jhCmDnw/edit?usp=sharing</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: \today</p>
<p class="author">Author: yu-shen</p>
<p class="date">Created: 2017-12-04 Mon 17:43</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
